//변수(Variable) - 변하는 값, 변하는 값을 저장하는 공간
//변수는 데이터를 저장하는 공간
//변수는 사용을 위해 먼저 변수를 선언해야 한다
//선언 문법 : 자료형(dataType) 변수명;
public class Variable01 {
    public static void main(String[] args){
        //변수의 선언
        //int : 정수를 저장할 수 있는 자료형
        //num : 변수명
        //num이라는 이름의 정수를 저장할 수 있는 공간을 선언
        //num이라는 이름의 정수를 저장할 수 있는 변수를 선언
        int num;

        //num2라는 이름의 정수를 저장할 수 있는 변수 선언
        int num2;

        //변수명은 중복 불가
        // int num;
        int NUM;
        int Num;
        //변수명은 대소문자를 구분
        //변수명은 소문자로 만들어라
        //변수명은 소문자로 만들어라
        //변수명은 소문자로 만들어라
        //변수명은 소문자로 만들어라
        //변수명은 소문자로 만들어라
    }
}
